# Introduction

In this notebook, we'll dive deep into a dataset all about LEGO. From the dataset we can ask whole bunch of interesting questions about the history of the LEGO company, their product offering, and which LEGO set ultimately rules them all:

<ul type="square">
<li>What is the most enormous LEGO set ever created and how many parts did it have?</li>

<li>How did the LEGO company start out? In which year were the first LEGO sets released and how many sets did the company sell when it first launched?</li>

<li>Which LEGO theme has the most sets? Is it one of LEGO's own themes like Ninjago or a theme they licensed liked Harry Potter or Marvel Superheroes?</li>

<li>When did the LEGO company really expand its product offering? Can we spot a change in the company strategy based on how many themes and sets it has released year-on-year?</li>

<li>Did LEGO sets grow in size and complexity over time? Do older LEGO 
sets tend to have more or fewer parts than newer sets?</li>
</ul>

**Data Source**

[Rebrickable](https://rebrickable.com/downloads/) has compiled data on all the LEGO pieces in existence. This data was fetched on October 12, 2021.

<img src="assets/bricks.jpg">

# Import Statements

In [26]:
import pandas as pd
from collections import Counter

# Data Exploration

**Challenge**: How many different colours does the LEGO company produce? Read the colors.csv file in the data folder and find the total number of unique colours. Try using the [.nunique() method](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.nunique.html?highlight=nunique#pandas.DataFrame.nunique) to accomplish this.

In [3]:
colors_df = pd.read_csv('data/colors.csv')

In [4]:
colors_df

       id                  name     rgb is_trans
0      -1             [Unknown]  0033B2        f
1       0                 Black  05131D        f
2       1                  Blue  0055BF        f
3       2                 Green  237841        f
4       3        Dark Turquoise  008F9B        f
..    ...                   ...     ...      ...
184  1058     Trans-Light Green  94E5AB        t
185  1059     Trans-Purple Opal  8320B7        t
186  1060      Trans-Green Opal  84B68D        t
187  1061  Trans-Dark Blue Opal  0020A0        t
188  9999  [No Color/Any Color]  05131D        f

[189 rows x 4 columns]

In [40]:
print("There are", colors_df['name'].nunique(), "unique colors of Lego blocks.")

There are 189 unique colors of Lego blocks.

**Challenge**: Find the number of transparent colours where <code>is_trans == 't'</code> versus the number of opaque colours where <code>is_trans == 'f'</code>. See if you can accomplish this in four different ways.

Method 1:

In [20]:
opaque = trans = 0
for cell in colors_df['is_trans']:
    if cell == "t":
        trans += 1
    else:
        opaque += 1
print(f"There are {opaque} opaque blocks and {trans} transparent blocks.")

There are 151 opaque blocks and 38 transparent blocks.

Method 2:

In [47]:
Counter(colors_df.is_trans.values)

Counter({'f': 151, 't': 38})

Method 3:

In [49]:
colors_df.groupby("is_trans").count()

           id  name  rgb
is_trans
f         151   151  151
t          38    38   38

Method 4:

In [45]:
colors_df['is_trans'].value_counts()

f    151
t     38
Name: is_trans, dtype: int64

### Understanding LEGO Themes vs. LEGO Sets

Walk into a LEGO store and you will see their products organised by **theme**. Their themes include Star Wars, Batman, Harry Potter and many more.

<img src="assets/lego_themes.png">

A lego **set** is a particular box of LEGO or product. Therefore, a single theme typically has many different sets.

<img src="assets/lego_sets.png">

The <code>sets.csv</code> data contains a list of sets over the years and the number of parts that each of these sets contained.

**Challenge**: Read the sets.csv data and take a look at the first and last couple of rows.

In [41]:
sets_df = pd.read_csv("data/sets.csv")

In [51]:
sets_df.head(2)

  set_num               name  year  theme_id  num_parts
0   001-1              Gears  1965         1         43
1  0011-2  Town Mini-Figures  1979        67         12

In [52]:
sets_df.tail(2)

          set_num                  name  year  theme_id  num_parts
18239  YTERRIER-1     Yorkshire Terrier  2018       598          0
18240    ZX8000-1  ZX 8000 LEGO Sneaker  2020       501          0

**Challenge**: In which year were the first LEGO sets released and what were these sets called?

In [140]:
oldest_year = sets_df.year.min()
print(f"The first Lego sets were made in {oldest_year}!")
oldest_year_df = sets_df[sets_df.year == oldest_year]
oldest_year_df

The first Lego sets were made in 1949!

       set_num                               name  year  theme_id  num_parts
10858  700.1-1         Extra-Large Gift Set (ABB)  1949       365        142
10871  700.2-1               Large Gift Set (ABB)  1949       365        178
10876  700.3-1              Medium Gift Set (ABB)  1949       365        142
10881  700.A-1              Small Brick Set (ABB)  1949       371         24
10882  700.B-1  Small Doors and Windows Set (ABB)  1949       371         12

**Challenge**: How many different sets did LEGO sell in their first year? How many types of LEGO products were on offer in the year the company started?

In [137]:
print(oldest_year_df.name.count(), "types of sets were being sold when the company started.")

5 types of sets were being sold when the company started.

**Challenge**: Find the top 6 LEGO sets with the most number of parts.

In [138]:
sets_df.sort_values(by="num_parts", ascending=False).head(6)

        set_num                           name  year  theme_id  num_parts
3797    31203-1                      World Map  2021       709      11695
17272  BIGBOX-1  The Ultimate Battle for Chima  2015       571       9987
319     10276-1                      Colosseum  2020       673       9036
12650   75192-1          UCS Millennium Falcon  2017       171       7541
11938   71043-1                Hogwarts Castle  2018       246       6020
297     10256-1                      Taj Mahal  2017       673       5923

**Challenge**: Use <code>.groupby()</code> and <code>.count()</code> to show the number of LEGO sets released year-on-year. How do the number of sets released in 1955 compare to the number of sets released in 2019?

In [109]:
year_grouped = sets_df.groupby("year").count()
year_grouped

      set_num  name  theme_id  num_parts
year
1949        5     5         5          5
1950        6     6         6          6
1953        4     4         4          4
1954       14    14        14         14
1955       28    28        28         28
...       ...   ...       ...        ...
2017      854   854       854        854
2018      853   853       853        853
2019      893   893       893        893
2020      898   898       898        898
2021      954   954       954        954

[71 rows x 4 columns]

In [128]:
data_1955 = year_grouped[year_grouped.index == 1955]
data_2019 = year_grouped[year_grouped.index == 2019]
print(f"{int(data_1955.set_num)} sets were released in 1955, while {int(data_2019.set_num)} sets were released in 2019.")

28 sets were released in 1955, while 893 sets were released in 2019.

**Challenge**: Show the number of LEGO releases on a line chart using Matplotlib. <br>
<br>
Note that the .csv file is from late 2020, so to plot the full calendar years, you will have to exclude some data from your chart. Can you use the slicing techniques covered in Day 21 to avoid plotting the last two years? The same syntax will work on Pandas DataFrames.

### Aggregate Data with the Python .agg() Function

Let's work out the number of different themes shipped by year. This means we have to count the number of unique theme_ids per calendar year.

**Challenge**: Plot the number of themes released by year on a line chart. Only include the full calendar years (i.e., exclude 2020 and 2021).

### Line Charts with Two Seperate Axes

**Challenge**: Use the <code>.groupby()</code> and <code>.agg()</code> function together to figure out the average number of parts per set. How many parts did the average LEGO set released in 1954 compared to say, 2017?

### Scatter Plots in Matplotlib

**Challenge**: Has the size and complexity of LEGO sets increased over time based on the number of parts? Plot the average number of parts over time using a Matplotlib scatter plot. See if you can use the [scatter plot documentation](https://matplotlib.org/3.1.0/api/_as_gen/matplotlib.pyplot.scatter.html) before I show you the solution. Do you spot a trend in the chart?

### Number of Sets per LEGO Theme

LEGO has licensed many hit franchises from Harry Potter to Marvel Super Heros to many others. But which theme has the largest number of individual sets?

**Challenge** Use what you know about HTML markup and tags to display the database schema: https://i.imgur.com/Sg4lcjx.png

### Database Schemas, Foreign Keys and Merging DataFrames

The themes.csv file has the actual theme names. The sets .csv has <code>theme_ids</code> which link to the <code>id</code> column in the themes.csv.

**Challenge**: Explore the themes.csv. How is it structured? Search for the name 'Star Wars'. How many <code>id</code>s correspond to this name in the themes.csv? Now use these <code>id</code>s and find the corresponding the sets in the sets.csv (Hint: you'll need to look for matches in the <code>theme_id</code> column)

### Merging (i.e., Combining) DataFrames based on a Key